Dotfiles/Dotfiles.org
#+title: My Dotfiles
#+author: Ranko Kohime
#+email: ranko.kohime@runbox.com
#+startup: content
#+property: header-args :mkdirp yes :tangle-mode (identity #o444) :comments both

* Notes
** [[https://emacs.stackexchange.com/questions/50246/how-to-use-org-headers-as-filenames-in-tangle][How to use org headers as filenames in tangle]]
# Local Variables:
# eval: (defun headline-title nil (let* ((x (save-mark-and-excursion (org-up-heading-safe) (org-element-property :title (org-element-at-point))))) (if (and x (not (string-match file-name-invalid-regexp x))) (format "%s" x) "yes")))
# End:

** Setting up TODO cookies
Press C-c C-c on the cookie

** [[https://ianyepan.github.io/posts/emacs-profiling/][Profiling Performance in Emacs]]
Use
#+begin_example
M-x profiler-start
#+end_example
and
#+begin_example
M-x profiler-stop
#+end_example
to capture, then do
#+begin_example
M-x profiler-report
#+end_example
to view the report

** [[https://nfo-maker.com/][NFO Maker]]

** [[https://zed.dev/][Zed.dev]]

* Todo
** Add [[https://github.com/skeeto/endlessh][Endlessh]] for servers perhaps?
** Checkout [[https://yggdrasil-network.github.io/][Yggdrasil Network]] for VPN
** Count lines of code with [[https://github.com/XAMPPRocky/tokei][Tokei]]
** Edit NixOS configuration graphically with [[https://github.com/snowfallorg/nixos-conf-editor][NixOS Conf Editor]]
** [[https://github.com/TheR1D/shell_gpt][ShellGPT]] for an AI in the shell (Boo!)
** An example Emacs configuration, [[https://github.com/kinnala/nixemacs][Nixemacs]]
** Annotate PDFs in Emacs using [[https://github.com/weirdNox/org-noter][org-noter]]
** Perhaps some locally hosted Copilot-ish AI using [[https://github.com/jart/emacs-copilot][emacs-copilot]]
** Self-hosted AI
*** [[https://khoj.dev/][Khoj AI]]
*** [[https://dev.to/timesurgelabs/how-to-run-llama-2-on-anything-3o5m][How to run Llama 2 on anything]]
** Grocy for grocery list
** [[https://hackaday.com/2009/09/18/how-to-write-udev-rules/][How to write udev rules]]
** Hardware enablements for NixOS
** Use [[https://github.com/ifd3f/caligula][Caligula]] for a dd alternative with a TUI
* App Configuration
** [[file:Alacritty.org][Alacritty]]
** [[file:Conky.org][Conky]]
** [[file:Emacs.org][Emacs]]
** [[file:MangoHud.org][MangoHud]]
** MPV [0/0]
*** input.conf
:properties:
:header-args+: :tangle no
:header-args+: :tangle-mode (identity #o444)
:header-args+: :comments no
:end:

header-args+: :tangle .config/mpv/input.conf

**** Commentary
List of special keys: --input-keylist
Keybindings testing mode: mpv --input-test --force-window --idle

Use 'ignore' to unbind a key fully (e.g. 'ctrl+a ignore').

Strings need to be quoted and escaped:
  KEY show-text "This is a single backslash: \\ and a quote: \" !"

You can use modifier-key combinations like Shift+Left or Ctrl+Alt+x with
the modifiers Shift, Ctrl, Alt and Meta (may not work on the terminal).

The default keybindings are hardcoded into the mpv binary.
You can disable them completely with: --no-input-default-bindings

Developer note:
On compilation, this file is baked into the mpv binary, and all lines are
uncommented (unless '#' is followed by a space) - thus this file defines the
default key bindings.

**** Default Bindings
If this is enabled, treat all the following bindings as default.
#+begin_src conf
default-bindings start
#+end_src

**** Mouse Buttons
#+begin_src conf
MBTN_LEFT     ignore              # don't do anything
MBTN_LEFT_DBL cycle fullscreen    # toggle fullscreen
MBTN_RIGHT    cycle pause         # toggle pause/playback mode
MBTN_BACK     playlist-prev       # skip to the previous file
MBTN_FORWARD  playlist-next       # skip to the next file
#+end_src

**** Mouse Wheel / Touchpad axis input
Mouse wheels, touchpad or other input devices that have axes
if the input devices supports precise scrolling it will also scale the
numeric value accordingly
#+begin_src conf
WHEEL_UP      seek 10          # seek 10 seconds forward
WHEEL_DOWN    seek -10         # seek 10 seconds backward
WHEEL_LEFT    add volume -2
WHEEL_RIGHT   add volume 2
#+end_src

**** Seeking
***** Standard Seeking
Seek units are in seconds, but note that these are limited by keyframes
#+begin_src conf
RIGHT seek  5
LEFT  seek -5
UP    seek  60
DOWN  seek -60
#+end_src

***** Shorter Seeking
Do smaller, always exact (non-keyframe-limited), seeks with shift.
Don't show them on the OSD (no-osd).
#+begin_src conf
Shift+RIGHT no-osd seek  1 exact
Shift+LEFT  no-osd seek -1 exact
Shift+UP    no-osd seek  5 exact
Shift+DOWN  no-osd seek -5 exact
#+end_src

***** Subtitle Seeking
#+begin_src conf
Ctrl+LEFT   no-osd sub-seek -1 # seek to the previous subtitle
Ctrl+RIGHT  no-osd sub-seek  1 # seek to the next subtitle
Ctrl+Shift+LEFT sub-step -1    # change subtitle timing such that the previous subtitle is displayed
Ctrl+Shift+RIGHT sub-step 1    # change subtitle timing such that the next subtitle is displayed
#+end_src

***** Longer Seeking
#+begin_src conf
PGUP add chapter 1                     # seek to the next chapter
PGDWN add chapter -1                   # seek to the previous chapter
Shift+PGUP seek 600                    # seek 10 minutes forward
Shift+PGDWN seek -600                  # seek 10 minutes backward
#+end_src

***** Revert Seek
#+begin_src conf
Shift+BS revert-seek                   # undo the previous (or marked) seek
Shift+Ctrl+BS revert-seek mark         # mark the position for revert-seek
#+end_src

**** Zoom and Pan
#+begin_src conf
Alt+left  add video-pan-x  0.1         # move the video right
Alt+right add video-pan-x -0.1         # move the video left
Alt+up    add video-pan-y  0.1         # move the video down
Alt+down  add video-pan-y -0.1         # move the video up
Alt++     add video-zoom   0.1         # zoom in
Alt+-     add video-zoom  -0.1         # zoom out
#+end_src

Reset zoom and pan settings
#+begin_src conf
Alt+BS set video-zoom 0 ; set video-pan-x 0 ; set video-pan-y 0
#+end_src

**** Playback speed
#+begin_src conf
[ multiply speed 1/1.1                 # decrease the playback speed
] multiply speed 1.1                   # increase the playback speed
{ multiply speed 0.5                   # halve the playback speed
} multiply speed 2.0                   # double the playback speed
BS set speed 1.0                       # reset the speed to normal
#+end_src

q quit
Q quit-watch-later                     # exit and remember the playback position
q {encode} quit 4
ESC set fullscreen no                  # leave fullscreen
ESC {encode} quit 4
p cycle pause                          # toggle pause/playback mode
. frame-step                           # advance one frame and pause
, frame-back-step                      # go back by one frame and pause
SPACE cycle pause                      # toggle pause/playback mode
> playlist-next                        # skip to the next file
ENTER playlist-next                    # skip to the next file
< playlist-prev                        # skip to the previous file
O no-osd cycle-values osd-level 3 1    # toggle displaying the OSD on user interaction or always
o show-progress                        # show playback progress
P show-progress                        # show playback progress
i script-binding stats/display-stats   # display information and statistics
I script-binding stats/display-stats-toggle # toggle displaying information and statistics
` script-binding console/enable        # open the console
z add sub-delay -0.1                   # shift subtitles 100 ms earlier
Z add sub-delay +0.1                   # delay subtitles by 100 ms
x add sub-delay +0.1                   # delay subtitles by 100 ms
ctrl++ add audio-delay 0.100           # change audio/video sync by delaying the audio
ctrl+- add audio-delay -0.100          # change audio/video sync by shifting the audio earlier
Shift+g add sub-scale +0.1             # increase the subtitle font size
Shift+f add sub-scale -0.1             # decrease the subtitle font size
9 add volume -2
/ add volume -2
0 add volume 2
(asterisk) * add volume 2
m cycle mute                           # toggle mute
1 add contrast -1
2 add contrast 1
3 add brightness -1
4 add brightness 1
5 add gamma -1
6 add gamma 1
7 add saturation -1
8 add saturation 1
Alt+0 set current-window-scale 0.5     # halve the window size
Alt+1 set current-window-scale 1.0     # reset the window size
Alt+2 set current-window-scale 2.0     # double the window size
d cycle deinterlace                    # toggle the deinterlacing filter
r add sub-pos -1                       # move subtitles up
R add sub-pos +1                       # move subtitles down
t add sub-pos +1                       # move subtitles down
v cycle sub-visibility                 # hide or show the subtitles
Alt+v cycle secondary-sub-visibility   # hide or show the secondary subtitles
V cycle sub-ass-vsfilter-aspect-compat # toggle stretching SSA/ASS subtitles with anamorphic videos to match the historical renderer
u cycle-values sub-ass-override "force" "no" # toggle overriding SSA/ASS subtitle styles with the normal styles
j cycle sub                            # switch subtitle track
J cycle sub down                       # switch subtitle track backwards
SHARP cycle audio                      # switch audio track
_ cycle video                          # switch video track
T cycle ontop                          # toggle placing the video on top of other windows
f cycle fullscreen                     # toggle fullscreen
s screenshot                           # take a screenshot of the video in its original resolution with subtitles
S screenshot video                     # take a screenshot of the video in its original resolution without subtitles
Ctrl+s screenshot window               # take a screenshot of the window with OSD and subtitles
Alt+s screenshot each-frame            # automatically screenshot every frame; issue this command again to stop taking screenshots
w add panscan -0.1                     # decrease panscan
W add panscan +0.1                     # shrink black bars by cropping the video
e add panscan +0.1                     # shrink black bars by cropping the video
A cycle-values video-aspect-override "16:9" "4:3" "2.35:1" "-1" # cycle the video aspect ratio ("-1" is the container aspect)
POWER quit
PLAY cycle pause                       # toggle pause/playback mode
PAUSE cycle pause                      # toggle pause/playback mode
PLAYPAUSE cycle pause                  # toggle pause/playback mode
PLAYONLY set pause no                  # unpause
PAUSEONLY set pause yes                # pause
STOP quit
FORWARD seek 60                        # seek 1 minute forward
REWIND seek -60                        # seek 1 minute backward
NEXT playlist-next                     # skip to the next file
PREV playlist-prev                     # skip to the previous file
VOLUME_UP add volume 2
VOLUME_DOWN add volume -2
MUTE cycle mute                        # toggle mute
CLOSE_WIN quit
CLOSE_WIN {encode} quit 4
ctrl+w quit
E cycle edition                        # switch edition
l ab-loop                              # set/clear A-B loop points
L cycle-values loop-file "inf" "no"    # toggle infinite looping
ctrl+c quit 4
DEL script-binding osc/visibility      # cycle OSC visibility between never, auto (mouse-move) and always
ctrl+h cycle-values hwdec "auto" "no"  # toggle hardware decoding
F8 show-text ${playlist}               # show the playlist
F9 show-text ${track-list}             # show the list of video, audio and sub tracks

#
# Legacy bindings (may or may not be removed in the future)
#
#! add chapter -1                       # seek to the previous chapter
#@ add chapter 1                        # seek to the next chapter

#
# Not assigned by default
# (not an exhaustive list of unbound commands)
#

# ? cycle sub-forced-only               # toggle DVD forced subs
# ? stop                                # stop playback (quit or enter idle mode)

*** mplayer-input.conf
##
## MPlayer-style key bindings
##
## Save it as ~/.config/mpv/input.conf to use it.
##
## Generally, it's recommended to use this as reference-only.
##

RIGHT seek +10
LEFT seek -10
DOWN seek -60
UP seek +60
PGUP seek 600
PGDWN seek -600
m cycle mute
SHARP cycle audio           # switch audio streams
+ add audio-delay 0.100
= add audio-delay 0.100
- add audio-delay -0.100
[ multiply speed 0.9091	# scale playback speed
] multiply speed 1.1
{ multiply speed 0.5
} multiply speed 2.0
BS set speed 1.0	# reset speed to normal
q quit
ESC quit
ENTER playlist-next force       # skip to next file
p cycle pause
. frame-step            # advance one frame and pause
SPACE cycle pause
HOME set playlist-pos 0 # not the same as MPlayer
#END pt_up_step -1
> playlist-next             # skip to next file
< playlist-prev             #         previous
#INS alt_src_step 1
#DEL alt_src_step -1
o osd
I show-text "${filename}"     # display filename in osd
P show-progress
z add sub-delay -0.1        # subtract 100 ms delay from subs
x add sub-delay +0.1        # add
9 add volume -1
/ add volume -1
0 add volume 1
 add volume 1
1 add contrast -1
2 add contrast 1
3 add brightness -1
4 add brightness 1
5 add hue -1
6 add hue 1
7 add saturation -1
8 add saturation 1
( add balance -0.1          # adjust audio balance in favor of left
) add balance +0.1          #                                  right
d cycle framedrop
D cycle deinterlace # toggle deinterlacer (auto-inserted filter)
r add sub-pos -1            # move subtitles up
t add sub-pos +1            #                down
#? sub-step +1		# immediately display next subtitle
#? sub-step -1		#                     previous
#? add sub-scale +0.1	# increase subtitle font size
#? add sub-scale -0.1	# decrease subtitle font size
f cycle fullscreen
T cycle ontop              # toggle video window ontop of other windows
w add panscan -0.1          # zoom out with -panscan 0 -fs
e add panscan +0.1          #      in
c cycle stream-capture             # save (and append) file/stream to stream.dump with -capture
s screenshot            # take a screenshot (if you want PNG, use "--screenshot-format=png")
S screenshot - each-frame # S will take a png screenshot of every frame

h cycle tv-channel 1
l cycle tv-channel -1
n cycle tv-norm
#b tv_step_chanlist

#? add chapter -1      # skip to previous dvd chapter
#? add chapter +1      #         next

##
## Advanced seek
## Uncomment the following lines to be able to seek to n% of the media with
## the Fx keys.
##
#F1 seek 10 absolute-percent
#F2 seek 20 absolute-percent
#F3 seek 30 absolute-percent
#F4 seek 40 absolute-percent
#F5 seek 50 absolute-percent
#F6 seek 60 absolute-percent
#F7 seek 70 absolute-percent
#F8 seek 80 absolute-percent
#F9 seek 90 absolute-percent

