Dotfiles/Dotfiles.org
*** mpv.conf
#
# Example mpv configuration file
#
# Warning:
#
# The commented example options usually do _not_ set the default values. Call
# mpv with --list-options to see the default values for most options. There is
# no builtin or example mpv.conf with all the defaults.
#
#
# Configuration files are read system-wide from /etc/mpv/mpv.conf
# and per-user from ~/.config/mpv/mpv.conf, where per-user settings override
# system-wide settings, all of which are overridden by the command line.
#
# Configuration file settings and the command line options use the same
# underlying mechanisms. Most options can be put into the configuration file
# by dropping the preceding '--'. See the man page for a complete list of
# options.
#
# Lines starting with '#' are comments and are ignored.
#
# See the CONFIGURATION FILES section in the man page
# for a detailed description of the syntax.
#
# Profiles should be placed at the bottom of the configuration file to ensure
# that settings wanted as defaults are not restricted to specific profiles.

##################
# video settings #
##################

# Start in fullscreen mode by default.
#fs=yes

# force starting with centered window
#geometry=50%:50%

# don't allow a new window to have a size larger than 90% of the screen size
#autofit-larger=90%x90%

# Do not close the window on exit.
#keep-open=yes

# Do not wait with showing the video window until it has loaded. (This will
# resize the window once video is loaded. Also always shows a window with
# audio.)
#force-window=immediate

# Disable the On Screen Controller (OSC).
#osc=no

# Keep the player window on top of all other windows.
#ontop=yes

# Specify high quality video rendering preset (for --vo=gpu only)
# Can cause performance problems with some drivers and GPUs.
#profile=gpu-hq

# Force video to lock on the display's refresh rate, and change video and audio
# speed to some degree to ensure synchronous playback - can cause problems
# with some drivers and desktop environments.
#video-sync=display-resample

# Enable hardware decoding if available. Often, this does not work with all
# video outputs, but should work well with default settings on most systems.
# If performance or energy usage is an issue, forcing the vdpau or vaapi VOs
# may or may not help.
#hwdec=auto

##################
# audio settings #
##################

# Specify default audio device. You can list devices with: --audio-device=help
# The option takes the device string (the stuff between the '...').
#audio-device=alsa/default

# Do not filter audio to keep pitch when changing playback speed.
#audio-pitch-correction=no

# Output 5.1 audio natively, and upmix/downmix audio with a different format.
#audio-channels=5.1
# Disable any automatic remix, _if_ the audio output accepts the audio format.
# of the currently played file. See caveats mentioned in the manpage.
# (The default is "auto-safe", see manpage.)
#audio-channels=auto

##################
# other settings #
##################

# Pretend to be a web browser. Might fix playback with some streaming sites,
# but also will break with shoutcast streams.
#user-agent="Mozilla/5.0"

# cache settings
#
# Use a large seekable RAM cache even for local input.
#cache=yes
#
# Use extra large RAM cache (needs cache=yes to make it useful).
#demuxer-max-bytes=500M
#demuxer-max-back-bytes=100M
#
# Disable the behavior that the player will pause if the cache goes below a
# certain fill size.
#cache-pause=no
#
# Store cache payload on the hard disk instead of in RAM. (This may negatively
# impact performance unless used for slow input such as network.)
#cache-dir=~/.cache/
#cache-on-disk=yes

# Display English subtitles if available.
#slang=en

# Play Finnish audio if available, fall back to English otherwise.
#alang=fi,en

# Change subtitle encoding. For Arabic subtitles use 'cp1256'.
# If the file seems to be valid UTF-8, prefer UTF-8.
# (You can add '+' in front of the codepage to force it.)
#sub-codepage=cp1256

# You can also include other configuration files.
#include=/path/to/the/file/you/want/to/include

############
# Profiles #
############

# The options declared as part of profiles override global default settings,
# but only take effect when the profile is active.

# The following profile can be enabled on the command line with: --profile=eye-cancer

#[eye-cancer]
#sharpen=5

*** restore-old-bindings.conf

# This file contains all bindings that were removed after a certain release.
# If you want MPlayer bindings, use mplayer-input.conf

# Pick the bindings you want back and add them to your own input.conf. Append
# this file to your input.conf if you want them all back:
#
#    cat restore-old-bindings.conf >> ~/.config/mpv/input.conf
#
# Older installations use ~/.mpv/input.conf instead.

# changed in mpv 0.27.0 (macOS and Wayland only)

# WHEEL_UP seek 10
# WHEEL_DOWN seek -10
# WHEEL_LEFT seek 5
# WHEEL_RIGHT seek -5

# changed in mpv 0.26.0

h cycle tv-channel -1                  # previous channel
k cycle tv-channel +1                  # next channel
H cycle dvb-channel-name -1            # previous channel
K cycle dvb-channel-name +1            # next channel

I show-text "${filename}"              # display filename in osd

# changed in mpv 0.24.0

L cycle-values loop "inf" "no"

# changed in mpv 0.10.0

O osd
D cycle deinterlace
d cycle framedrop

# changed in mpv 0.7.0

ENTER playlist-next force

# changed in mpv 0.6.0

ESC quit

# changed in mpv 0.5.0

PGUP seek 600
PGDWN seek -600
RIGHT seek  10
LEFT  seek -10
+ add audio-delay 0.100
- add audio-delay -0.100
( add balance -0.1
) add balance 0.1
F cycle sub-forced-only
TAB cycle program
A cycle angle
U stop
o osd
I show-text "${filename}"

*** Playback
**** Save playback position when exiting player before end of video
#+begin_src conf
save-position-on-quit
#+end_src

**** Do not close the window on exit
#+begin_src conf
#keep-open=yes
#+end_src

**** Don't allow a new window to have a size larger than 90% of the screen size
#+begin_src conf
autofit-larger=90%x90%
#+end_src

**** Force window
Do not wait with showing the video window until it has loaded. (This will
resize the window once video is loaded. Also always shows a window with
audio.)
#+begin_src conf
force-window=immediate
#+end_src

**** Disable the On Screen Controller (OSC).
#+begin_src conf
#osc=no
#+end_src

**** Force starting with centered window
#+begin_src conf
geometry=50%:50%
#+end_src

*** Video Settings
**** Maintain original video aspect ratio
#+begin_src conf
keepaspect=yes
#+end_src

**** Start in fullscreen mode by default.
#+begin_src conf
fs=no
#+end_src

**** Keep the player window on top of all other windows.
#+begin_src conf
ontop=yes
#+end_src

**** Video sync
Force video to lock on the display's refresh rate, and change video and audio
speed to some degree to ensure synchronous playback - can cause problems
with some drivers and desktop environments.
#+begin_src conf
video-sync=display-resample
#+end_src

**** Video rendering
***** Rendering preset
Specify high quality video rendering preset (for --vo=gpu only)
Can cause performance problems with some drivers and GPUs.
#+begin_src conf
profile=gpu-hq
#+end_src

***** Video output
#+begin_src conf
vo=gpu
#+end_src

***** Hardware decoding
Enable hardware decoding if available. Often, this does not work with all
video outputs, but should work well with default settings on most systems.
If performance or energy usage is an issue, forcing the vdpau or vaapi VOs
may or may not help.
#+begin_src conf
hwdec=auto
#+end_src

***** GPU context
#+begin_src conf
#gpu-context=wayland
#+end_src

*** Audio Settings
**** Default audio device
Specify default audio device. You can list devices with: --audio-device=help
The option takes the device string (the stuff between the '...').
#+begin_src conf
#audio-device=alsa/default
#+end_src

**** Pitch correction
Do not filter audio to keep pitch when changing playback speed.
#+begin_src conf
#audio-pitch-correction=no
#+end_src

**** Force channel count
Output 5.1 audio natively, and upmix/downmix audio with a different format.
#+begin_src conf
#audio-channels=5.1
#+end_src

**** Automatic remixing
Disable any automatic remix, _if_ the audio output accepts the audio format.
of the currently played file. See caveats mentioned in the manpage.
(The default is "auto-safe", see manpage.)
#+begin_src conf
#audio-channels=auto
#+end_src

**** Maximum volume limit
#+begin_src conf
volume-max=250
#+end_src

*** Subtitles
**** Display ${lang} subtitles if available
#+begin_src conf
#slang=en
#+end_src

**** Play Finnish audio if available, fall back to English otherwise.
#+begin_src conf
#alang=fi,en
#+end_src

**** Subtitle encoding
# Change subtitle encoding. For Arabic subtitles use 'cp1256'.
# If the file seems to be valid UTF-8, prefer UTF-8.
# (You can add '+' in front of the codepage to force it.)
#+begin_src conf
#sub-codepage=cp1256
#+end_src

*** Screenshots
**** Set screenshot type to PNG
#+begin_src conf
screenshot-format=png
#+end_src

**** Set screenshot folder
#+begin_src conf
screenshot-directory=~/Downloads
#+end_src

*** General
**** User agent
Pretend to be a web browser. Might fix playback with some streaming sites,
but also will break with shoutcast streams.
#+begin_src conf
#user-agent="Mozilla/5.0"
#+end_src

**** Cache settings
***** Use 300MB input cache by default. The cache is enabled for network streams only.
#+begin_src conf
cache-default=307200
#+end_src

***** Use 300MB input cache for everything, even local files.
#+begin_src conf
cache=307200
#+end_src

***** Cache pause
Disable the behavior that the player will pause if the cache goes below a
certain fill size.
#+begin_src conf
cache-pause=no
#+end_src

