.config/mpv/mpv.conf
# [[file:../../Dotfiles.org::*Save playback position when exiting player before end of video][Save playback position when exiting player before end of video:1]]
save-position-on-quit
# Save playback position when exiting player before end of video:1 ends here

# [[file:../../Dotfiles.org::*Do not close the window on exit][Do not close the window on exit:1]]
#keep-open=yes
# Do not close the window on exit:1 ends here

# [[file:../../Dotfiles.org::*Don't allow a new window to have a size larger than 90% of the screen size][Don't allow a new window to have a size larger than 90% of the screen size:1]]
autofit-larger=90%x90%
# Don't allow a new window to have a size larger than 90% of the screen size:1 ends here


# Do not wait with showing the video window until it has loaded. (This will
# resize the window once video is loaded. Also always shows a window with
# audio.)

# [[file:../../Dotfiles.org::*Force window][Force window:1]]
force-window=immediate
# Force window:1 ends here

# [[file:../../Dotfiles.org::*Disable the On Screen Controller (OSC).][Disable the On Screen Controller (OSC).:1]]
#osc=no
# Disable the On Screen Controller (OSC).:1 ends here

# [[file:../../Dotfiles.org::*Force starting with centered window][Force starting with centered window:1]]
geometry=50%:50%
# Force starting with centered window:1 ends here

# [[file:../../Dotfiles.org::*Maintain original video aspect ratio][Maintain original video aspect ratio:1]]
keepaspect=yes
# Maintain original video aspect ratio:1 ends here

# [[file:../../Dotfiles.org::*Start in fullscreen mode by default.][Start in fullscreen mode by default.:1]]
fs=no
# Start in fullscreen mode by default.:1 ends here

# [[file:../../Dotfiles.org::*Keep the player window on top of all other windows.][Keep the player window on top of all other windows.:1]]
ontop=yes
# Keep the player window on top of all other windows.:1 ends here


# Force video to lock on the display's refresh rate, and change video and audio
# speed to some degree to ensure synchronous playback - can cause problems
# with some drivers and desktop environments.

# [[file:../../Dotfiles.org::*Video sync][Video sync:1]]
video-sync=display-resample
# Video sync:1 ends here


# Specify high quality video rendering preset (for --vo=gpu only)
# Can cause performance problems with some drivers and GPUs.

# [[file:../../Dotfiles.org::*Rendering preset][Rendering preset:1]]
profile=gpu-hq
# Rendering preset:1 ends here

# [[file:../../Dotfiles.org::*Video output][Video output:1]]
vo=gpu
# Video output:1 ends here


# Enable hardware decoding if available. Often, this does not work with all
# video outputs, but should work well with default settings on most systems.
# If performance or energy usage is an issue, forcing the vdpau or vaapi VOs
# may or may not help.

# [[file:../../Dotfiles.org::*Hardware decoding][Hardware decoding:1]]
hwdec=auto
# Hardware decoding:1 ends here

# [[file:../../Dotfiles.org::*GPU context][GPU context:1]]
#gpu-context=wayland
# GPU context:1 ends here


# Specify default audio device. You can list devices with: --audio-device=help
# The option takes the device string (the stuff between the '...').

# [[file:../../Dotfiles.org::*Default audio device][Default audio device:1]]
#audio-device=alsa/default
# Default audio device:1 ends here


# Do not filter audio to keep pitch when changing playback speed.

# [[file:../../Dotfiles.org::*Pitch correction][Pitch correction:1]]
#audio-pitch-correction=no
# Pitch correction:1 ends here


# Output 5.1 audio natively, and upmix/downmix audio with a different format.

# [[file:../../Dotfiles.org::*Force channel count][Force channel count:1]]
#audio-channels=5.1
# Force channel count:1 ends here


# Disable any automatic remix, _if_ the audio output accepts the audio format.
# of the currently played file. See caveats mentioned in the manpage.
# (The default is "auto-safe", see manpage.)

# [[file:../../Dotfiles.org::*Automatic remixing][Automatic remixing:1]]
#audio-channels=auto
# Automatic remixing:1 ends here

# [[file:../../Dotfiles.org::*Maximum volume limit][Maximum volume limit:1]]
volume-max=250
# Maximum volume limit:1 ends here

# [[file:../../Dotfiles.org::*Display ${lang} subtitles if available][Display ${lang} subtitles if available:1]]
#slang=en
# Display ${lang} subtitles if available:1 ends here

# [[file:../../Dotfiles.org::*Play Finnish audio if available, fall back to English otherwise.][Play Finnish audio if available, fall back to English otherwise.:1]]
#alang=fi,en
# Play Finnish audio if available, fall back to English otherwise.:1 ends here


# # Change subtitle encoding. For Arabic subtitles use 'cp1256'.
# # If the file seems to be valid UTF-8, prefer UTF-8.
# # (You can add '+' in front of the codepage to force it.)

# [[file:../../Dotfiles.org::*Subtitle encoding][Subtitle encoding:1]]
#sub-codepage=cp1256
# Subtitle encoding:1 ends here

# [[file:../../Dotfiles.org::*Set screenshot type to PNG][Set screenshot type to PNG:1]]
screenshot-format=png
# Set screenshot type to PNG:1 ends here

# [[file:../../Dotfiles.org::*Set screenshot folder][Set screenshot folder:1]]
screenshot-directory=~/Downloads
# Set screenshot folder:1 ends here


# Pretend to be a web browser. Might fix playback with some streaming sites,
# but also will break with shoutcast streams.

# [[file:../../Dotfiles.org::*User agent][User agent:1]]
#user-agent="Mozilla/5.0"
# User agent:1 ends here

# [[file:../../Dotfiles.org::*Use 300MB input cache by default. The cache is enabled for network streams only.][Use 300MB input cache by default. The cache is enabled for network streams only.:1]]
cache-default=307200
